-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-01-13 09:56:52
-- 伺服器版本： 10.4.22-MariaDB
-- PHP 版本： 8.0.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `minori_coffee`
--

-- --------------------------------------------------------

--
-- 資料表結構 `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL COMMENT '類別編號',
  `cat_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '類別名稱',
  `parent_id` int(11) NOT NULL DEFAULT 0 COMMENT '上層編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `categories`
--

INSERT INTO `categories` (`id`, `cat_name`, `parent_id`, `created_at`, `updated_at`) VALUES
(1, '豆單', 0, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(2, '嚴選商品', 0, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(3, '熱銷排行', 0, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(4, '咖啡器材', 0, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(5, '以酸度分類', 1, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(6, '以洲別分類', 1, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(7, '以處理法分類', 1, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(8, '以烘培度分類', 1, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(9, '明亮酸', 5, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(10, '酸', 5, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(11, '柔和酸', 5, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(12, '不酸', 5, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(13, '美洲', 6, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(14, '非洲', 6, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(15, '亞洲', 6, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(16, '日曬', 7, '2021-12-28 11:23:57', '2021-12-28 11:23:57'),
(17, '水洗', 7, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(18, '蜜處理', 7, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(19, '特殊', 7, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(20, '淺焙', 8, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(21, '中淺焙', 8, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(22, '中焙', 8, '2021-12-28 11:23:58', '2021-12-28 11:23:58'),
(23, '中深焙', 8, '2021-12-28 11:23:58', '2021-12-28 11:23:58');

-- --------------------------------------------------------

--
-- 資料表結構 `coupon`
--

CREATE TABLE `coupon` (
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'email',
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'coupon代碼',
  `isUsed` tinyint(1) NOT NULL DEFAULT 0 COMMENT '是否被使用(0:無;1:有)',
  `percentage` float NOT NULL DEFAULT 0.8 COMMENT '原價百分比',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `created_up` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `coupon`
--

INSERT INTO `coupon` (`email`, `code`, `isUsed`, `percentage`, `created_at`, `created_up`) VALUES
('cpocheng32@gmail.com', 'b7d0902793ef0183c6d1f6c66d1c4063', 0, 0.8, '2021-12-28 16:59:27', '2022-01-10 16:17:00'),
('qqq@gmail.com', 'WELCOME20220108172130', 0, 0.8, '2022-01-08 17:21:30', '2022-01-08 17:21:30');

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `id` int(10) NOT NULL COMMENT '流水號',
  `order_id` varchar(13) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '訂單編號',
  `email` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '使用者email',
  `recipient_email` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者 E-mail',
  `recipient_name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者姓名',
  `recipient_phone_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者手機號碼',
  `recipient_address` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者地址',
  `recipient_comments` text COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者備註	',
  `invoice_type` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票類型',
  `invoice_carrier` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具',
  `invoice_carrier_number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具編號',
  `coupon_code` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '優惠券代碼',
  `card_number` varchar(16) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡號碼',
  `card_valid_date` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡到期年限',
  `card_ccv` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡CCV',
  `card_holder` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡持有人',
  `cartage` tinyint(4) DEFAULT NULL COMMENT '運費',
  `total` int(11) DEFAULT NULL COMMENT '總額',
  `total_m` int(11) DEFAULT NULL COMMENT '優惠後總額',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`id`, `order_id`, `email`, `recipient_email`, `recipient_name`, `recipient_phone_number`, `recipient_address`, `recipient_comments`, `invoice_type`, `invoice_carrier`, `invoice_carrier_number`, `coupon_code`, `card_number`, `card_valid_date`, `card_ccv`, `card_holder`, `cartage`, `total`, `total_m`, `created_at`, `updated_at`) VALUES
(1, '2022011100001', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', '', '9b698a1d4a8a1461', '505374989e', '4f0f5c96ca', 'd46432d5b3a697a1e420703b23956de82f468741', 0, 8104, 8104, '2022-01-11 10:02:12', '2022-01-11 10:02:12'),
(2, '2022011100002', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '1233', 'b7d0902793ef0183c6d1f6c66d1c4063', '4e6a47b1f0d04aa0', '505374989e', '81110df80c', 'd46432d5b3a697a1e420703b23956de82f468741', 0, 5948, 4759, '2022-01-11 10:10:11', '2022-01-11 10:10:11'),
(3, '2022011100003', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 5080, 4064, '2022-01-11 10:23:52', '2022-01-11 10:23:52'),
(4, '2022011100004', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', '8e8062409c1877e0', '505374989e', 'cfa1150f17', 'aacefd9402180b5f427949fd4e74a3151137ccda', 0, 8217, 6574, '2022-01-11 10:29:59', '2022-01-11 10:29:59'),
(5, '2022011100005', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 6748, 5399, '2022-01-11 10:48:22', '2022-01-11 10:48:22'),
(6, '2022011100006', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', '', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 0, 0, '2022-01-11 11:07:48', '2022-01-11 11:07:48'),
(7, '2022011100007', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', '', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 120, 818, 818, '2022-01-11 11:28:37', '2022-01-11 11:28:37'),
(8, '2022011100008', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', '', '07eefb3115b532f9', '64004ade4d', '1c6637a8f2', '43814346e21444aaf4f70841bf7ed5ae93f55a9d', 0, 1767, 1767, '2022-01-11 12:16:55', '2022-01-11 12:16:55'),
(9, '2022011100009', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', '', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 0, 0, '2022-01-11 12:18:14', '2022-01-11 12:18:14'),
(10, '2022011100010', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', '0c4413543daffe97', '505374989e', 'cd3f0c85b1', 'cd3f0c85b158c08a2b113464991810cf2cdfc387', 0, 13229, 13229, '2022-01-11 15:07:48', '2022-01-11 15:07:48'),
(11, '2022011100011', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', '0c4413543daffe97', '505374989e', 'cd3f0c85b1', 'cd3f0c85b158c08a2b113464991810cf2cdfc387', 0, 13229, 13229, '2022-01-11 15:16:11', '2022-01-11 15:16:11'),
(12, '2022011100012', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 13229, NULL, '2022-01-11 15:22:16', '2022-01-11 15:22:16'),
(13, '2022011100013', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 18012, 14410, '2022-01-11 15:32:26', '2022-01-11 15:32:26'),
(14, '2022011100014', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 15591, NULL, '2022-01-11 15:40:43', '2022-01-11 15:40:43'),
(15, '2022011100015', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 15591, NULL, '2022-01-11 15:43:40', '2022-01-11 15:43:40'),
(16, '2022011100016', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', '', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 6294, 6294, '2022-01-11 15:45:56', '2022-01-11 15:45:56'),
(17, '2022011100017', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 2065, 1652, '2022-01-11 15:55:16', '2022-01-11 15:55:16'),
(18, '2022011100018', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 6588, 5271, '2022-01-11 16:01:58', '2022-01-11 16:01:58'),
(19, '2022011100019', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'b5b9bb2360f5fa3d', '505374989e', '1c6637a8f2', 'f56d6351aa71cff0debea014d13525e42036187a', 0, 11192, 8954, '2022-01-11 16:10:06', '2022-01-11 16:10:06'),
(20, '2022011100020', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 120, 3490, 2792, '2022-01-11 16:14:47', '2022-01-11 16:14:47'),
(21, '2022011100021', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'bd396e09f47f2079', '64004ade4d', '1c6637a8f2', 'd46432d5b3a697a1e420703b23956de82f468741', 0, 16788, 13431, '2022-01-11 16:20:03', '2022-01-11 16:20:03'),
(22, '2022011100022', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 16788, 13431, '2022-01-11 16:29:34', '2022-01-11 16:29:34'),
(23, '2022011100023', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 8304, 6644, '2022-01-11 16:32:18', '2022-01-11 16:32:18'),
(24, '2022011100024', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 10980, 8784, '2022-01-11 18:09:50', '2022-01-11 18:09:50'),
(25, '2022011200025', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 7104, 5684, '2022-01-12 15:05:05', '2022-01-12 15:05:05'),
(26, '2022011200026', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', '5aab0703d8e504fd', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 16544, 13236, '2022-01-12 15:35:17', '2022-01-12 15:35:17'),
(27, '2022011200027', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', '', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 7275, 7275, '2022-01-12 16:09:47', '2022-01-12 16:09:47'),
(28, '2022011200028', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 10929, 8744, '2022-01-12 16:13:45', '2022-01-12 16:13:45'),
(29, '2022011200029', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 17928, 14343, '2022-01-12 16:44:33', '2022-01-12 16:44:33'),
(30, '2022011200030', 'cpocheng32@gmail.com', '', '', '', '', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', 'da39a3ee5e6b4b0d', 'da39a3ee5e', 'da39a3ee5e', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 6846, 5477, '2022-01-12 17:00:24', '2022-01-12 17:00:24'),
(31, '2022011200031', 'cpocheng32@gmail.com', 'cpocheng32@gmail.com', 'ポーチェン チェン', '8088873066', '332', '', '電子發票', '隨包裹', '', 'b7d0902793ef0183c6d1f6c66d1c4063', '836c1cfcedc4ae38', 'da39a3ee5e', '1c6637a8f2', 'da39a3ee5e6b4b0d3255bfef95601890afd80709', 0, 10144, 8116, '2022-01-12 19:56:46', '2022-01-12 19:56:46');

-- --------------------------------------------------------

--
-- 資料表結構 `orders_detail`
--

CREATE TABLE `orders_detail` (
  `order_id` varchar(13) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `prod_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `prod_size` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品重量',
  `prod_times` tinyint(1) DEFAULT NULL COMMENT '價差倍數',
  `prod_grind` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '磨豆',
  `prod_qty` int(11) DEFAULT NULL COMMENT '商品數量',
  `prod_subtotal` int(11) DEFAULT NULL COMMENT '商品小計',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders_detail`
--

INSERT INTO `orders_detail` (`order_id`, `prod_id`, `prod_name`, `prod_price`, `prod_size`, `prod_times`, `prod_grind`, `prod_qty`, `prod_subtotal`, `created_at`, `updated_at`) VALUES
('2022011100001', 3, '耶加雪菲 晨之莓', 379, '一磅', NULL, '磨粉', 7, 5306, '2022-01-11 10:02:12', '2022-01-11 10:02:12'),
('2022011100001', 5, '碧雅莊園 藝妓', 1399, '半磅', NULL, '原豆', 2, 2798, '2022-01-11 10:02:12', '2022-01-11 10:02:12'),
('2022011100002', 1, '耶加雪菲', 349, '2.2磅', NULL, '磨粉', 1, 1396, '2022-01-11 10:10:11', '2022-01-11 10:10:11'),
('2022011100002', 7, '奧茲瑪', 569, '一磅', NULL, '磨粉', 4, 4552, '2022-01-11 10:10:11', '2022-01-11 10:10:11'),
('2022011100003', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 3, 2007, '2022-01-11 10:23:52', '2022-01-11 10:23:52'),
('2022011100003', 10, '莓橘小姐', 439, '半磅', NULL, '原豆', 7, 3073, '2022-01-11 10:23:52', '2022-01-11 10:23:52'),
('2022011100004', 8, '獅子王', 669, '半磅', NULL, '原豆', 9, 6021, '2022-01-11 10:29:59', '2022-01-11 10:29:59'),
('2022011100004', 14, '你說陽光會在風雨後', 549, '半磅', NULL, '原豆', 4, 2196, '2022-01-11 10:29:59', '2022-01-11 10:29:59'),
('2022011100005', 2, '花神', 349, '半磅', NULL, '磨粉', 4, 1396, '2022-01-11 10:48:22', '2022-01-11 10:48:22'),
('2022011100005', 6, '桃樂絲', 669, '2.2磅', NULL, '原豆', 2, 5352, '2022-01-11 10:48:22', '2022-01-11 10:48:22'),
('2022011100007', 2, '花神', 349, '半磅', NULL, '原豆', 2, 698, '2022-01-11 11:28:37', '2022-01-11 11:28:37'),
('2022011100008', 6, '桃樂絲', 669, '半磅', NULL, '磨粉', 1, 669, '2022-01-11 12:16:55', '2022-01-11 12:16:55'),
('2022011100008', 14, '你說陽光會在風雨後', 549, '半磅', NULL, '磨粉', 2, 1098, '2022-01-11 12:16:55', '2022-01-11 12:16:55'),
('2022011100010', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:07:48', '2022-01-11 15:07:48'),
('2022011100010', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:07:48', '2022-01-11 15:07:48'),
('2022011100011', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:16:11', '2022-01-11 15:16:11'),
('2022011100011', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:16:11', '2022-01-11 15:16:11'),
('2022011100012', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:22:16', '2022-01-11 15:22:16'),
('2022011100012', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:22:16', '2022-01-11 15:22:16'),
('2022011100013', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:32:26', '2022-01-11 15:32:26'),
('2022011100013', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:32:26', '2022-01-11 15:32:26'),
('2022011100014', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:40:43', '2022-01-11 15:40:43'),
('2022011100014', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:40:43', '2022-01-11 15:40:43'),
('2022011100015', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:43:40', '2022-01-11 15:43:40'),
('2022011100015', 17, '曼巴頓練習曲', 369, '半磅', NULL, '原豆', 3, 1107, '2022-01-11 15:43:40', '2022-01-11 15:43:40'),
('2022011100016', 1, '耶加雪菲', 349, '半磅', NULL, '原豆', 2, 698, '2022-01-11 15:45:56', '2022-01-11 15:45:56'),
('2022011100016', 5, '碧雅莊園 藝妓', 1399, '2.2磅', NULL, '原豆', 1, 5596, '2022-01-11 15:45:56', '2022-01-11 15:45:56'),
('2022011100017', 2, '花神', 349, '一磅', NULL, '原豆', 2, 1396, '2022-01-11 15:55:16', '2022-01-11 15:55:16'),
('2022011100017', 6, '桃樂絲', 669, '半磅', NULL, '原豆', 1, 669, '2022-01-11 15:55:16', '2022-01-11 15:55:16'),
('2022011100018', 14, '你說陽光會在風雨後', 549, '2.2磅', NULL, '原豆', 3, 6588, '2022-01-11 16:01:58', '2022-01-11 16:01:58'),
('2022011100019', 5, '碧雅莊園 藝妓', 1399, '2.2磅', NULL, '原豆', 2, 11192, '2022-01-11 16:10:06', '2022-01-11 16:10:06'),
('2022011100020', 2, '花神', 349, '一磅', NULL, '原豆', 5, 3490, '2022-01-11 16:14:47', '2022-01-11 16:14:47'),
('2022011100021', 5, '碧雅莊園 藝妓', 1399, '2.2磅', NULL, '原豆', 3, 16788, '2022-01-11 16:20:03', '2022-01-11 16:20:03'),
('2022011100022', 5, '碧雅莊園 藝妓', 1399, '2.2磅', NULL, '原豆', 3, 16788, '2022-01-11 16:29:34', '2022-01-11 16:29:34'),
('2022011100023', 11, '夏日山亭微醺夢', 519, '2.2磅', NULL, '磨粉', 4, 8304, '2022-01-11 16:32:18', '2022-01-11 16:32:18'),
('2022011100024', 14, '你說陽光會在風雨後', 549, '2.2磅', NULL, '磨粉', 5, 10980, '2022-01-11 18:09:50', '2022-01-11 18:09:50'),
('2022011200025', 6, '桃樂絲', 669, '2.2磅', NULL, '磨粉', 1, 2676, '2022-01-12 15:05:05', '2022-01-12 15:05:05'),
('2022011200025', 17, '曼巴頓練習曲', 369, '2.2磅', NULL, '原豆', 3, 4428, '2022-01-12 15:05:05', '2022-01-12 15:05:05'),
('2022011200026', 5, '碧雅莊園 藝妓', 1399, '2.2磅', 4, '原豆', 2, 11192, '2022-01-12 15:35:17', '2022-01-12 15:35:17'),
('2022011200026', 8, '獅子王', 669, '2.2磅', 4, '原豆', 2, 5352, '2022-01-12 15:35:17', '2022-01-12 15:35:17'),
('2022011200027', 1, '耶加雪菲', 349, '半磅', 1, '磨粉', 3, 1047, '2022-01-12 16:09:47', '2022-01-12 16:09:47'),
('2022011200027', 13, '斯里蘭卡的調酒師', 519, '2.2磅', 4, '原豆', 3, 6228, '2022-01-12 16:09:47', '2022-01-12 16:09:47'),
('2022011200028', 13, '斯里蘭卡的調酒師', 519, '2.2磅', 4, '原豆', 5, 10380, '2022-01-12 16:13:45', '2022-01-12 16:13:45'),
('2022011200028', 14, '你說陽光會在風雨後', 549, '半磅', 1, '原豆', 1, 549, '2022-01-12 16:13:45', '2022-01-12 16:13:45'),
('2022011200029', 3, '耶加雪菲 晨之莓', 379, '2.2磅', 4, '原豆', 3, 4548, '2022-01-12 16:44:33', '2022-01-12 16:44:33'),
('2022011200029', 8, '獅子王', 669, '2.2磅', 4, '原豆', 5, 13380, '2022-01-12 16:44:33', '2022-01-12 16:44:33'),
('2022011200030', 2, '花神', 349, '一磅', 2, '原豆', 3, 2094, '2022-01-12 17:00:24', '2022-01-12 17:00:24'),
('2022011200030', 8, '獅子王', 669, '2.2磅', 4, '原豆', 1, 2676, '2022-01-12 17:00:24', '2022-01-12 17:00:24'),
('2022011200030', 11, '夏日山亭微醺夢', 519, '2.2磅', 4, '磨粉', 1, 2076, '2022-01-12 17:00:24', '2022-01-12 17:00:24'),
('2022011200031', 6, '桃樂絲', 669, '2.2磅', 4, '磨粉', 2, 5352, '2022-01-12 19:56:46', '2022-01-12 19:56:46'),
('2022011200031', 34, '凱薩路易斯 火山藝伎', 1198, '一磅', 2, '原豆', 2, 4792, '2022-01-12 19:56:46', '2022-01-12 19:56:46');

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL COMMENT '商品流水號',
  `prod_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品主要圖片',
  `prod_thumbnail` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品縮圖',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格(半磅)',
  `prod_description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品描述',
  `prod_bake` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '烘焙',
  `prod_flavor` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '酸度',
  `prod_area` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '產地',
  `prod_process` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '處理法',
  `cat_id` int(10) DEFAULT NULL COMMENT '類別編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`id`, `prod_name`, `prod_image`, `prod_thumbnail`, `prod_price`, `prod_description`, `prod_bake`, `prod_flavor`, `prod_area`, `prod_process`, `cat_id`, `created_at`, `updated_at`) VALUES
(1, '耶加雪菲', './img/beans_l_001.jpg', './img/beans_s_001.jpg', 349, '柑橘、李子、麥芽糖、有著厚實圓的風味。', '淺焙', '酸', '非洲', '水洗', 10, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(2, '花神', './img/beans_l_002.jpg', './img/beans_s_002.jpg', 349, '帶著太妃糖甜感，冷卻時會有生巧克力且明亮細緻的酸質。', '中焙', '柔和酸', '美洲', '水洗', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(3, '耶加雪菲 晨之莓', './img/beans_l_003.jpg', './img/beans_s_003.jpg', 379, '典型耶加雪菲風味，莓果和些許茶感，細膩優雅。', '中淺焙', '酸', '非洲', '日曬', 17, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(4, '吉格薩', './img/beans_l_004.jpg', './img/beans_s_004.jpg', 399, '焦糖、柑橘皮、清爽的甜感和茶的尾韻。', '淺焙', '柔和酸', '非洲', '水洗', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(5, '碧雅莊園 藝妓', './img/beans_l_005.jpg', './img/beans_s_005.jpg', 1399, '玫瑰花、荔枝、豐富的熱帶水果、奶油厚實的口感。', '淺焙', '明亮酸', '美洲', '日曬', 11, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(6, '桃樂絲', './img/beans_l_006.jpg', './img/beans_s_006.jpg', 669, '葡萄酒香、辛香料、黑巧克力、香草植物、桃子的香氣。', '淺焙', '明亮酸', '美洲', '蜜處理', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(7, '奧茲瑪', './img/beans_l_007.jpg', './img/beans_s_007.jpg', 569, '黑櫻桃、葡萄柚、可可粉、降溫後出現芭樂、綜合蔬果汁風味。', '淺焙', '酸', '美洲', '蜜處理', 17, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(8, '獅子王', './img/beans_l_008.jpg', './img/beans_s_008.jpg', 669, '橘子、白葡萄、花香、蜂蜜般的甜感、些許的酒味。', '中淺焙', '明亮酸', '美洲', '蜜處理', 22, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(9, '巨石莊園 藝妓', './img/beans_l_009.jpg', './img/beans_s_009.jpg', 599, '成熟蘋果、黑醋栗等深色水果、些許肉桂、奶油和香檳的尾韻。', '中淺焙', '酸', '美洲', '蜜處理', 10, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(10, '莓橘小姐', './img/beans_l_010.jpg', './img/beans_s_010.jpg', 439, '柑橘和紅色莓果的風味，水果酸值明亮。降溫後紅糖的尾韻延續。', '淺焙', '明亮酸', '非洲', '蜜處理', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(11, '夏日山亭微醺夢', './img/beans_l_011.jpg', './img/beans_s_011.jpg', 519, '深色莓果的酸甜，和巧可力的調性，尾韻透出微醺的酒香', '淺焙', '明亮酸', '非洲', '日曬', 16, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(12, '水果藝伎嘉年華', './img/beans_l_012.jpg', './img/beans_s_012.jpg', 519, '豐富的水果酸甜感，帶黑莓和柑橘風味，明亮多層次。', '淺焙', '明亮酸', '非洲', '水洗', 21, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(13, '斯里蘭卡的調酒師', './img/beans_l_013.jpg', './img/beans_s_013.jpg', 519, '焦糖核桃風味，帶有明亮的果酸，帶些許的肉桂與葡萄酒香。', '中淺焙', '明亮酸', '美洲', '日曬', 11, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(14, '你說陽光會在風雨後', './img/beans_l_014.jpg', './img/beans_s_014.jpg', 549, '帶果乾風味，奶油堅果般的中等口感，尾韻是麥芽糖的餘韻。', '中淺焙', '柔和酸', '亞洲', '日曬', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(15, '小獵犬', './img/beans_l_015.jpg', './img/beans_s_015.jpg', 339, '莓果、奶油、核果、巧克力。', '中焙', '柔和酸', '美洲', '日曬', 17, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(16, '麥芽糖風笛手', './img/beans_l_016.jpg', './img/beans_s_016.jpg', 379, '烤堅果為主軸，伴隨著麥芽糖的清甜感，茶的綿長尾韻，清爽細膩。', '中焙', '柔和酸', '美洲', '水洗', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(17, '曼巴頓練習曲', './img/beans_l_017.jpg', './img/beans_s_017.jpg', 369, '濃郁醇厚的口感，菸草和黑巧克力的餘韻，苦中回甘。', '中深焙', '不酸', '亞洲', '水洗', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(18, '牧羊犬', './img/beans_l_018.jpg', './img/beans_s_018.jpg', 329, '適合加奶，可可、堅果、甜感足。', '中深焙', '不酸', '亞洲', '日曬', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(19, '耶加雪啡 荷芙莎', './img/beans_l_019.jpg', './img/beans_s_019.jpg', 499, '紅葡萄、楓糖，果汁感，甜感飽滿。', '淺焙', '明亮酸', '非洲', '日曬', 16, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(20, '柯契爾', './img/beans_l_020.jpg', './img/beans_s_020.jpg', 469, '細緻花香、金桔檸檬、葡萄柚的明亮酸甜。', '淺焙', '酸', '非洲', '日曬', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(21, '果丁丁特選', './img/beans_l_021.jpg', './img/beans_s_021.jpg', 469, '香水檸檬、佛手柑的前段香氣，風味強烈。', '淺焙', '酸', '非洲', '水洗', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(22, '雪冽圖 山梨花', './img/beans_l_022.jpg', './img/beans_s_022.jpg', 499, '深色漿果、檀香、橘子皮、茉莉、甜熱帶水果、優雅濃郁。', '淺焙', '明亮酸', '非洲', '日曬', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(23, '肯亞', './img/beans_l_023.jpg', './img/beans_s_023.jpg', 499, '細緻的花香、酸梅汁般的酸甜感，降溫之後出現深色莓果的風味。', '淺焙', '明亮酸', '非洲', '水洗', 18, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(24, '哥斯大黎加 寶藏莊園', './img/beans_l_024.jpg', './img/beans_s_024.jpg', 499, '黑色莓果、熱帶水果風味，尾韻是乾淨的茶香。', '中淺焙', '酸', '美洲', '蜜處理', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(25, '哥斯大黎加 小蜜蜂', './img/beans_l_025.jpg', './img/beans_s_025.jpg', 519, '奶油白花的前段香味，葡萄、桃子等水果風味，帶有滑順的口感。', '中淺焙', '酸', '美洲', '蜜處理', 10, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(26, '哥斯大黎加 芒果莊園', './img/beans_l_026.jpg', './img/beans_s_026.jpg', 539, '豐富的水果調性，帶有些許發酵酒與果乾風味。', '中淺焙', '酸', '美洲', '蜜處理', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(27, '熱紅酒', './img/beans_l_027.jpg', './img/beans_s_027.jpg', 899, '綿延的肉桂香氣是整體的風味主軸，尾韻呈現乾淨而溫和的甜感。', '中淺焙', '酸', '美洲', '蜜處理', 18, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(28, '紫風鈴', './img/beans_l_028.jpg', './img/beans_s_028.jpg', 429, '綿延的肉桂香氣是整體的風味主軸，尾韻呈現乾淨而溫和的甜感。', '中淺焙', '酸', '非洲', '水洗', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(29, '教父', './img/beans_l_029.jpg', './img/beans_s_029.jpg', 399, '在深焙的烘焙程度下，帶出豐厚的油脂感，烤堅果和可可的苦甜。', '中深焙', '不酸', '美洲', '水洗', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(30, '糖老鴨', './img/beans_l_030.jpg', './img/beans_s_030.jpg', 449, '麥芽糖及焦糖甜感，低溫出現柔和的果酸，每個溫層的變化豐富。', '中焙', '柔和酸', '美洲', '水洗', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(31, '塔拉珠', './img/beans_l_031.jpg', './img/beans_s_031.jpg', 449, '果乾與烤堅果風味，帶有滑順口感，是一隻清爽的蜜處理。', '中焙', '柔和酸', '美洲', '蜜處理', 18, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(32, '薇薇特南果', './img/beans_l_032.jpg', './img/beans_s_032.jpg', 349, '烤堅果、花生醬的風味，苦甜厚實，更適合加奶飲用。', '中深焙', '不酸', '美洲', '水洗', 21, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(33, '可可森巴', './img/beans_l_033.jpg', './img/beans_s_033.jpg', 379, '香草、奶油、烤堅果、口感醇厚、風味紮實、甜度佳。', '中深焙', '不酸', '美洲', '日曬', 10, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(34, '凱薩路易斯 火山藝伎', './img/beans_l_034.jpg', './img/beans_s_034.jpg', 1198, '在溫度稍微下降，哈密瓜精緻的風味出現，整體清爽、酸值迷人。', '中淺焙', '酸', '美洲', '日曬', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(35, '古吉罕貝拉 布榖阿貝兒 ', './img/beans_l_035.jpg', './img/beans_s_035.jpg', 950, '會有強烈的花香氣，飲用時清爽醇厚的口感，尾韻帶著溫帶水果風。', '淺焙', '不酸', '非洲', '日曬', 18, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(36, '水果風華', './img/beans_l_036.jpg', './img/beans_s_036.jpg', 918, '撲鼻而來的是草莓果醬、濃郁木瓜牛奶、帶有起司的濃郁、及優格。', '中淺焙', '酸', '美洲', '特殊', 21, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(37, '古吉 水仙', './img/beans_l_037.jpg', './img/beans_s_037.jpg', 798, '水仙帶有與其他水洗一樣的清爽酸質，圓潤醇度、尾韻回甘。', '中淺焙', '明亮酸', '非洲', '水洗', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(38, '薩爾瓦多 聖伊蓮娜', './img/beans_l_038.jpg', './img/beans_s_038.jpg', 499, '葡萄、果乾、焦糖的甜感，口感乾淨厚實。', '中淺焙', '明亮酸', '美洲', '蜜處理', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(39, '聖塔安娜火山 雷納斯', './img/beans_l_039.jpg', './img/beans_s_039.jpg', 538, '入口深色莓果和橘皮，最後焦糖及烏龍茶香，口感層次豐富、順口。', '中焙', '柔和酸', '美洲', '蜜處理', 18, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(40, '西達摩 桃子甜心', './img/beans_l_040.jpg', './img/beans_s_040.jpg', 598, '溫度高時有著草莓和百香果的酸感，溫度降低時帶有點酒香。', '中淺焙', '柔和酸', '非洲', '日曬', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(41, '尼加拉瓜 米耶瑞詡', './img/beans_l_041.jpg', './img/beans_s_041.jpg', 598, '酒香、黑莓、蔓越莓，帶有特殊的熱帶水果香氣。', '中焙', '酸', '美洲', '日曬', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(42, '耶加雪菲 班可', './img/beans_l_042.jpg', './img/beans_s_042.jpg', 469, '檸檬、橙色水果、小紅莓、口感滑順、酸甜感平衡。', '中淺焙', '明亮酸', '非洲', '水洗', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(43, '牧羊人', './img/beans_l_043.jpg', './img/beans_s_043.jpg', 499, '柑橘、草莓果醬、芒果乾、尾韻有綜合莓果調。', '淺焙', '明亮酸', '非洲', '日曬', 16, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(44, '貝多芬', './img/beans_l_044.jpg', './img/beans_s_044.jpg', 579, '綠葡萄、香草、草莓、甜瓜、柑橘香氣，紅石榴果汁酸香。', '淺焙', '明亮酸', '美洲', '水洗', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(45, '牙買加 藍山', './img/beans_l_045.jpg', './img/beans_s_045.jpg', 1399, '榛果、奶油、 楓糖，蘋果般酸質，Body細緻黏稠。', '中淺焙', '柔和酸', '美洲', '水洗', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(46, '塔拉珠', './img/beans_l_046.jpg', './img/beans_s_046.jpg', 449, '烘烤核果、奶油、紅糖、果乾、甜水果調、酸甜感圓潤甜蜜。', '中淺焙', '柔和酸', '美洲', '蜜處理', 14, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(47, '哥倫比亞 蘭姆酒桶', './img/beans_l_047.jpg', './img/beans_s_047.jpg', 759, '蘭姆酒、麝香葡萄、櫻桃、核果、 酒香巧克力。', '中淺焙', '柔和酸', '美洲', '水洗', 17, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(48, '莫札特', './img/beans_l_048.jpg', './img/beans_s_048.jpg', 599, '甜度、稠度、厚度相當良好，有著類似香蕉乾的熟果甜味。', '淺焙', '酸', '美洲', '蜜處理', 20, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(49, '鳳凰舞妓', './img/beans_l_049.jpg', './img/beans_s_049.jpg', 599, '可可酒香、熱帶水果、口感豐厚飽滿、日曬風味強勁紮實。', '淺焙', '明亮酸', '非洲', '日曬', 9, '2021-12-30 14:52:31', '2021-12-30 14:52:31'),
(50, '蒲隆地', './img/beans_l_050.jpg', './img/beans_s_050.jpg', 399, '奶油可可、烤堅果、紅糖、甜感佳。', '中焙', '柔和酸', '非洲', '水洗', 13, '2021-12-30 14:52:31', '2021-12-30 14:52:31');

-- --------------------------------------------------------

--
-- 資料表結構 `products_grind`
--

CREATE TABLE `products_grind` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `prod_grind` varchar(15) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '磨豆',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products_grind`
--

INSERT INTO `products_grind` (`id`, `prod_grind`, `prod_id`, `created_at`, `updated_at`) VALUES
(1, '原豆', 1, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(2, '磨粉', 1, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(3, '原豆', 2, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(4, '磨粉', 2, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(5, '原豆', 3, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(6, '磨粉', 3, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(7, '原豆', 4, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(8, '磨粉', 4, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(9, '原豆', 5, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(10, '磨粉', 5, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(11, '原豆', 6, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(12, '磨粉', 6, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(13, '原豆', 7, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(14, '磨粉', 7, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(15, '原豆', 8, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(16, '磨粉', 8, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(17, '原豆', 9, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(18, '磨粉', 9, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(19, '原豆', 10, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(20, '磨粉', 10, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(21, '原豆', 11, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(22, '磨粉', 11, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(23, '原豆', 12, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(24, '磨粉', 12, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(25, '原豆', 13, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(26, '磨粉', 13, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(27, '原豆', 14, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(28, '磨粉', 14, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(29, '原豆', 15, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(30, '磨粉', 15, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(31, '原豆', 16, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(32, '磨粉', 16, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(33, '原豆', 17, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(34, '磨粉', 17, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(35, '原豆', 18, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(36, '磨粉', 18, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(37, '原豆', 19, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(38, '磨粉', 19, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(39, '原豆', 20, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(40, '磨粉', 20, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(41, '原豆', 21, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(42, '磨粉', 21, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(43, '原豆', 22, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(44, '磨粉', 22, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(45, '原豆', 23, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(46, '磨粉', 23, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(47, '原豆', 24, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(48, '磨粉', 24, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(49, '原豆', 25, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(50, '磨粉', 25, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(51, '原豆', 26, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(52, '磨粉', 26, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(53, '原豆', 27, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(54, '磨粉', 27, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(55, '原豆', 28, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(56, '磨粉', 28, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(57, '原豆', 29, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(58, '磨粉', 29, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(59, '原豆', 30, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(60, '磨粉', 30, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(61, '原豆', 31, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(62, '磨粉', 31, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(63, '原豆', 32, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(64, '磨粉', 32, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(65, '原豆', 33, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(66, '磨粉', 33, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(67, '原豆', 34, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(68, '磨粉', 34, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(69, '原豆', 35, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(70, '磨粉', 35, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(71, '原豆', 36, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(72, '磨粉', 36, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(73, '原豆', 37, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(74, '磨粉', 37, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(75, '原豆', 38, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(76, '磨粉', 38, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(77, '原豆', 39, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(78, '磨粉', 39, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(79, '原豆', 40, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(80, '磨粉', 40, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(81, '原豆', 41, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(82, '磨粉', 41, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(83, '原豆', 42, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(84, '磨粉', 42, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(85, '原豆', 43, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(86, '磨粉', 43, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(87, '原豆', 44, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(88, '磨粉', 44, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(89, '原豆', 45, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(90, '磨粉', 45, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(91, '原豆', 46, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(92, '磨粉', 46, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(93, '原豆', 47, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(94, '磨粉', 47, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(95, '原豆', 48, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(96, '磨粉', 48, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(97, '原豆', 49, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(98, '磨粉', 49, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(99, '原豆', 50, '2021-12-30 15:20:25', '2021-12-30 15:20:25'),
(100, '磨粉', 50, '2021-12-30 15:20:25', '2021-12-30 15:20:25');

-- --------------------------------------------------------

--
-- 資料表結構 `products_size`
--

CREATE TABLE `products_size` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `prod_size` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品重量',
  `prod_times` tinyint(1) DEFAULT NULL COMMENT '價差倍數',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products_size`
--

INSERT INTO `products_size` (`id`, `prod_size`, `prod_times`, `prod_id`, `created_at`, `updated_at`) VALUES
(1, '半磅', 1, 1, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(2, '一磅', 2, 1, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(3, '2.2磅', 4, 1, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(4, '半磅', 1, 2, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(5, '一磅', 2, 2, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(6, '2.2磅', 4, 2, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(7, '半磅', 1, 3, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(8, '一磅', 2, 3, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(9, '2.2磅', 4, 3, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(10, '半磅', 1, 4, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(11, '一磅', 2, 4, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(12, '2.2磅', 4, 4, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(13, '半磅', 1, 5, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(14, '一磅', 2, 5, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(15, '2.2磅', 4, 5, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(16, '半磅', 1, 6, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(17, '一磅', 2, 6, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(18, '2.2磅', 4, 6, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(19, '半磅', 1, 7, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(20, '一磅', 2, 7, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(21, '2.2磅', 4, 7, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(22, '半磅', 1, 8, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(23, '一磅', 2, 8, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(24, '2.2磅', 4, 8, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(25, '半磅', 1, 9, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(26, '一磅', 2, 9, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(27, '2.2磅', 4, 9, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(28, '半磅', 1, 10, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(29, '一磅', 2, 10, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(30, '2.2磅', 4, 10, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(31, '半磅', 1, 11, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(32, '一磅', 2, 11, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(33, '2.2磅', 4, 11, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(34, '半磅', 1, 12, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(35, '一磅', 2, 12, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(36, '2.2磅', 4, 12, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(37, '半磅', 1, 13, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(38, '一磅', 2, 13, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(39, '2.2磅', 4, 13, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(40, '半磅', 1, 14, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(41, '一磅', 2, 14, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(42, '2.2磅', 4, 14, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(43, '半磅', 1, 15, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(44, '一磅', 2, 15, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(45, '2.2磅', 4, 15, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(46, '半磅', 1, 16, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(47, '一磅', 2, 16, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(48, '2.2磅', 4, 16, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(49, '半磅', 1, 17, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(50, '一磅', 2, 17, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(51, '2.2磅', 4, 17, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(52, '半磅', 1, 18, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(53, '一磅', 2, 18, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(54, '2.2磅', 4, 18, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(55, '半磅', 1, 19, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(56, '一磅', 2, 19, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(57, '2.2磅', 4, 19, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(58, '半磅', 1, 20, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(59, '一磅', 2, 20, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(60, '2.2磅', 4, 20, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(61, '半磅', 1, 21, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(62, '一磅', 2, 21, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(63, '2.2磅', 4, 21, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(64, '半磅', 1, 22, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(65, '一磅', 2, 22, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(66, '2.2磅', 4, 22, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(67, '半磅', 1, 23, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(68, '一磅', 2, 23, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(69, '2.2磅', 4, 23, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(70, '半磅', 1, 24, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(71, '一磅', 2, 24, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(72, '2.2磅', 4, 24, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(73, '半磅', 1, 25, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(74, '一磅', 2, 25, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(75, '2.2磅', 4, 25, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(76, '半磅', 1, 26, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(77, '一磅', 2, 26, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(78, '2.2磅', 4, 26, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(79, '半磅', 1, 27, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(80, '一磅', 2, 27, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(81, '2.2磅', 4, 27, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(82, '半磅', 1, 28, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(83, '一磅', 2, 28, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(84, '2.2磅', 4, 28, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(85, '半磅', 1, 29, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(86, '一磅', 2, 29, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(87, '2.2磅', 4, 29, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(88, '半磅', 1, 30, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(89, '一磅', 2, 30, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(90, '2.2磅', 4, 30, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(91, '半磅', 1, 31, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(92, '一磅', 2, 31, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(93, '2.2磅', 4, 31, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(94, '半磅', 1, 32, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(95, '一磅', 2, 32, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(96, '2.2磅', 4, 32, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(97, '半磅', 1, 33, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(98, '一磅', 2, 33, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(99, '2.2磅', 4, 33, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(100, '半磅', 1, 34, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(101, '一磅', 2, 34, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(102, '2.2磅', 4, 34, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(103, '半磅', 1, 35, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(104, '一磅', 2, 35, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(105, '2.2磅', 4, 35, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(106, '半磅', 1, 36, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(107, '一磅', 2, 36, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(108, '2.2磅', 4, 36, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(109, '半磅', 1, 37, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(110, '一磅', 2, 37, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(111, '2.2磅', 4, 37, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(112, '半磅', 1, 38, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(113, '一磅', 2, 38, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(114, '2.2磅', 4, 38, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(115, '半磅', 1, 39, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(116, '一磅', 2, 39, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(117, '2.2磅', 4, 39, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(118, '半磅', 1, 40, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(119, '一磅', 2, 40, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(120, '2.2磅', 4, 40, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(121, '半磅', 1, 41, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(122, '一磅', 2, 41, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(123, '2.2磅', 4, 41, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(124, '半磅', 1, 42, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(125, '一磅', 2, 42, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(126, '2.2磅', 4, 42, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(127, '半磅', 1, 43, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(128, '一磅', 2, 43, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(129, '2.2磅', 4, 43, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(130, '半磅', 1, 44, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(131, '一磅', 2, 44, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(132, '2.2磅', 4, 44, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(133, '半磅', 1, 45, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(134, '一磅', 2, 45, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(135, '2.2磅', 4, 45, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(136, '半磅', 1, 46, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(137, '一磅', 2, 46, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(138, '2.2磅', 4, 46, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(139, '半磅', 1, 47, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(140, '一磅', 2, 47, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(141, '2.2磅', 4, 47, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(142, '半磅', 1, 48, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(143, '一磅', 2, 48, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(144, '2.2磅', 4, 48, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(145, '半磅', 1, 49, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(146, '一磅', 2, 49, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(147, '2.2磅', 4, 49, '2021-12-30 15:48:05', '2022-01-07 15:12:00'),
(148, '半磅', 1, 50, '2021-12-30 15:48:05', '2022-01-07 15:10:28'),
(149, '一磅', 2, 50, '2021-12-30 15:48:05', '2022-01-07 15:11:46'),
(150, '2.2磅', 4, 50, '2021-12-30 15:48:05', '2022-01-07 15:12:00');

-- --------------------------------------------------------

--
-- 資料表結構 `relative`
--

CREATE TABLE `relative` (
  `cat_id` int(10) DEFAULT NULL COMMENT '類別編號',
  `prod_id` int(10) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `relative`
--

INSERT INTO `relative` (`cat_id`, `prod_id`, `created_at`, `updated_at`) VALUES
(9, 5, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 6, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 8, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 10, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 11, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 12, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 13, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 19, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 22, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 23, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 37, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 38, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 42, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 43, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 44, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(9, 49, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 1, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 3, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 7, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 9, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 20, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 21, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 24, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 25, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 26, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 27, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 28, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 34, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 36, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 41, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(10, 48, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 2, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 4, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 14, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 15, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 16, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 30, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 31, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 39, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 40, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 45, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 46, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 47, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(11, 50, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 17, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 18, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 29, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 32, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 33, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(12, 35, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 2, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 5, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 6, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 7, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 8, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 9, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 13, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 15, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 16, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 24, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 25, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 26, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 27, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 29, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 30, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 31, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 32, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 33, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 34, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 36, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 38, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 39, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 41, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 44, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 45, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 46, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 47, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(13, 48, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 1, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 3, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 4, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 10, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 11, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 12, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 19, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 20, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 21, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 22, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 23, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 28, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 35, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 37, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 40, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 42, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 43, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 49, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(14, 50, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(15, 14, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(15, 17, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(15, 18, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 3, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 5, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 11, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 13, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 14, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 15, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 18, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 19, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 20, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 22, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 33, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 34, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 35, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 40, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 41, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 43, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(16, 49, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 1, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 2, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 4, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 12, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 16, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 17, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 21, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 23, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 28, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 29, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 30, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 32, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 37, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 42, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 44, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 45, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 47, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(17, 50, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 6, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 7, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 8, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 9, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 10, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 24, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 25, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 26, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 27, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 31, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 38, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 39, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 46, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(18, 48, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(19, 36, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 1, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 4, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 5, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 6, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 7, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 10, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 11, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 12, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 19, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 20, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 21, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 22, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 23, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 35, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 43, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 44, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 48, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(20, 49, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 3, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 8, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 9, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 13, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 14, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 24, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 25, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 26, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 27, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 28, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 34, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 36, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 37, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 38, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 40, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 42, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 45, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 46, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(21, 47, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 2, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 15, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 16, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 30, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 31, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 39, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 41, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(22, 50, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(23, 17, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(23, 18, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(23, 29, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(23, 32, '2022-01-05 12:04:22', '2022-01-05 12:04:22'),
(23, 33, '2022-01-05 12:04:22', '2022-01-05 12:04:22');

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '姓名',
  `birthdate` date NOT NULL COMMENT '生日',
  `phone_number` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '手機號碼',
  `address` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '通訊地址',
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'Email(設定為帳號)',
  `pwd` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密碼',
  `verified_code` char(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '驗證碼',
  `isActivated` tinyint(1) NOT NULL DEFAULT 0 COMMENT '是否啟用',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`name`, `birthdate`, `phone_number`, `address`, `email`, `pwd`, `verified_code`, `isActivated`, `created_at`, `updated_at`) VALUES
('aaa', '2021-12-15', '8088873066', '１－５－１２', 'aaa@gmail.com', '7e240de74fb1ed08fa08d38063f6a6a91462a815', '9d7dcc3e47056e8675ca865da1338a0d', 0, '2022-01-05 10:43:15', '2022-01-05 10:43:37'),
('ポーチェン チェン', '2021-12-03', '8088873066', '332', 'cpocheng32@gmail.com', '7e240de74fb1ed08fa08d38063f6a6a91462a815', '54572644df6007364c005ae041b54614', 1, '2021-12-20 17:47:11', '2021-12-20 17:48:07'),
('ddd', '2021-12-08', '8088873066', '１－５－１２', 'ddd@gmail.com', 'bf9661defa3daecacfde5bde0214c4a439351d4d', '38f2ae6d9ce4aa3532e004b3a49dd05c', 0, '2022-01-07 11:41:59', '2022-01-07 11:42:19'),
('qqq', '2021-12-08', '8088873066', '１－５－１２', 'qqq@gmail.com', 'a056c8d05ae9ac6ca180bc991b93b7ffe37563e0', 'e08b025a6cb59649fc72670517e5ca9b', 0, '2022-01-08 17:21:21', '2022-01-08 17:21:30'),
('sss', '2021-12-08', '8088873066', '１－５－１２', 'sss@gmail.com', 'bf9661defa3daecacfde5bde0214c4a439351d4d', '1b5eaa8a1b455f3c797a7e029828e5d9', 0, '2022-01-05 15:34:40', '2022-01-05 15:34:53');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `coupon`
--
ALTER TABLE `coupon`
  ADD PRIMARY KEY (`email`,`code`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `orders_detail`
--
ALTER TABLE `orders_detail`
  ADD PRIMARY KEY (`order_id`,`prod_id`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `products_grind`
--
ALTER TABLE `products_grind`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `products_size`
--
ALTER TABLE `products_size`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`email`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '類別編號', AUTO_INCREMENT=24;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=32;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品流水號', AUTO_INCREMENT=51;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_grind`
--
ALTER TABLE `products_grind`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=101;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_size`
--
ALTER TABLE `products_size`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=151;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
